tutorials/multiphaseEuler/boilingBed/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (gas liquid solid);

gas
{
    type            purePhaseModel;

    diameterModel
    {
        type            constant;
        d               0.001;
    }

    residualAlpha   1e-6;
}

liquid
{
    type            purePhaseModel;

    diameterModel
    {
        type            residualDiameter;
        d               0.003;
        dResidual       0.0001;
    }

    residualAlpha   1e-6;
}

solid
{
    type            pureStationaryPhaseModel;

    diameterModel
    {
        type            constant;
        d               0.01;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.gas 0.7;
        minPartlyContinuousAlpha.gas 0.5;
        minFullyContinuousAlpha.liquid 0.5;
        minPartlyContinuousAlpha.liquid 0.3;
        minFullyContinuousAlpha.solid none;
        minPartlyContinuousAlpha.solid none;
    }
}

surfaceTension
{
    liquid_gas
    {
        type            constant;
        sigma           0.0589;
    }
}

// ************************************************************************* //
